const GREETINGS =
  "Вітаємо!\n\nГоворити зі світом однією мовою — це просто! Щоб вивчити мову, достатньо почати з малої: записатися на курси. Найефективнішими визнані мовні курси за кордоном, коли студент повністю занурюється в іноземне мовне середовище і застосовує нові знання на практиці.";

const TARIFF_PLANS = "🗓 Тарифні плани";
const MY_PAYMENT = "💳 Передплата";
const MY_PROFILE = "👤 Мій профіль";
const SUPPORT = "🤝 Підтримка";
const CERTIFICATE = "🪪 Сертифікат";
const REVIEWS = "👍 Відгуки";

const TARIFF_A1 = "Тариф A1";
const TARIFF_A2 = "Тариф A2";
const TARIFF_B1 = "Тариф B1";

const BACK = "↩️ Повернутись";

const TARIFF_A1_DESCRIPTION =
  "Базовий рівень A1 – це основи мови; знання дозволяють вирішувати якісь прості побутові та повсякденні питання, зазвичай використовуються прості фрази та вирази.\n\nВартість - 100 $ (курс/міс)";
const TARIFF_A2_DESCRIPTION =
  "Базовий рівень A2 – це основи мови; знання дозволяють вирішувати якісь прості побутові та повсякденні питання, зазвичай використовуються прості фрази та вирази.\n\nВартість - 150 $ (курс/міс)";
const TARIFF_B1_DESCRIPTION =
  "Середній рівень B1 - це повноцінне знання мови та граматики, уміння будувати довгі фрази та ін., непоганий словниковий запас.\n\nВартість - 150 $ (курс/міс)";

const PAY_NOW = "Сплатити зараз";
const LET_ME_THINK = "⏰ Хочу подумати, нагадайте";
const DONT_REMIND = "⛔️ Не нагадувати";

const NO_PHOTO_CAPTION =
  "Вкажіть будь ласка ім'я та прізвище відправника у підписі до фото.";

const FULL_NAME =
  "Напишіть будь ласка повне ім'я та прізвище відповіддю на це повідомлення. Ця інформація необхідна нам для зарахування Вас на курс та після завершення курсу для друку сертифікату.";

const QUESTIONARY =
  "Давай трохи про тебе дізнаємося 😉\nНапиши, будь ласка, кілька речень про себе відповіддю на це повідомлення.";

module.exports = {
  CONSTANTS: {
    GREETINGS,
    TARIFF_PLANS,
    MY_PAYMENT,
    MY_PROFILE,
    SUPPORT,
    CERTIFICATE,
    REVIEWS,
    TARIFF_A1,
    TARIFF_A2,
    TARIFF_B1,
    BACK,
    TARIFF_A1_DESCRIPTION,
    TARIFF_A2_DESCRIPTION,
    TARIFF_B1_DESCRIPTION,
    PAY_NOW,
    LET_ME_THINK,
    DONT_REMIND,
    NO_PHOTO_CAPTION,
    FULL_NAME,
    QUESTIONARY,
  },
};
